In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sqlalchemy import create_engine
import os, yaml # credentials:

In [2]:
# Récup des info de connection
with open('config.yaml', 'r') as file:
    config = yaml.safe_load(file)
#print(config)

cfg=config['PG']
# Connection à BDD
url = "{driver}://{user}:{password}@{host}/{database}".format(**cfg)
print('URL', url)
engine = create_engine(url)
engine

URL postgresql+psycopg2://postgres:greta2023@greta-p2-g2.westeurope.cloudapp.azure.com/netfloox

Engine(postgresql+psycopg2://postgres:***@greta-p2-g2.westeurope.cloudapp.azure.com/netfloox)

In [3]:
y = pd.read_sql("""
                select tr.tconst, tr."averageRating" from title_ratings tr
                left join title_basics tb
                on (tr.tconst = tb.tconst)
                where tb."titleType" = 'movie';
                """, engine)

In [4]:
y.shape

(286806, 2)

In [5]:
df = pd.read_sql("""
                 select tr.tconst, "primaryTitle", genres from title_basics tb
                 left join title_ratings tr
                 on (tr.tconst = tb.tconst)
                 where tb."titleType" = 'movie';
                 """, engine)

In [6]:
df = df.dropna(subset='tconst')

In [7]:
df

,tconst,primaryTitle,genres
1,tt2091256,Captain Underpants: The First Epic Movie,"Action,Adventure,Animation"
5,tt2091288,Black Web,"Drama,Sci-Fi,Thriller"
9,tt2091291,The Marriage,Documentary
12,tt2091295,Everyone's Going to Die,Drama
16,tt2091301,Geek War,Comedy
...,...,...,...
634811,tt2086958,Zheruiyk,Drama
634812,tt20869650,Exegesis Lovecraft,Documentary
634813,tt20869764,Watergate: High Crimes in the White House,Documentary
634822,tt20871026,Mini DV,Documentary
634824,tt20871388,Il grande giorno,Comedy

In [10]:
df_directors = pd.read_sql("""
                           select tr.tconst, tp.nconst from title_principals tp
                           left join title_ratings tr
                           on (tr.tconst = tp.tconst)
                           where tp.category = 'director';
                           """, engine)

In [12]:
df_directors.dropna(subset='tconst')

            tconst     nconst
0        tt0000621  nm0280432
1        tt0000004  nm0721526
2        tt0000011  nm0804434
3        tt0000014  nm0525910
4        tt0000020  nm0010291
...            ...        ...
6298464  tt9500466  nm8348029
6298469  tt9501748  nm2155426
6298620  tt9514932  nm0918999
6298669  tt9520770  nm3421630
6298707  tt9525214  nm0006604

[1095760 rows x 2 columns]